{
  "name": "Bạch Dinh",
  "latitude": 10.35090141696533,
  "longitude": 107.06862216161177,
  "content": "https://baria-vungtau.gov.vn/sphere/baria/vungtau/page/print.cpx?uuid=5b28ae6052568924f5613131\n\n\n\n\n\nhttps://phuong1.vungtau.baria-vungtau.gov.vn/di-tich-danh-thang/-/view-content/765862/bach-dinh-toa-biet-thu-phap-giua-long-thanh-pho-bien-vung-tau\n# Bạch Dinh – Tòa biệt thự Pháp giữa lòng thành phố biển Vũng Tàu - Cổng thông tin điện tử - Phường 1\nBạch Dinh – Tòa biệt thự Pháp giữa lòng thành phố biển Vũng Tàu\nBạch Dinh (tên tiếng Pháp: Villa Blanche- nghĩa là Biệt thự trắng) mang lối kiến trúc châu Âu độc đáo từ cuối thế kỷ 19 và được xây dựng từ năm 1898 đến năm 1902, do kiến trúc sư người Pháp Gustave Eiffel vẽ nên. Đây từng là nơi được dùng làm nơi nghỉ mát cho Toàn quyền Đông Dương, vua Thành Thái, Hoàng đế Bảo Đại và các thời tổng thống Việt Nam Cộng Hòa.\nHoàng đế Minh Mạng từng cho xây dựngPháo đài Phước Thắngtại nơi đây để kiểm soát cửa biểnCần Giờ. Sau khi chiếm được quyền cai trịĐông Dương, chính quyềnthực dân Phápđã cho san phẳng pháo đài để xây dựng một dinh thự dùng làm nơi nghỉ mát cho các Toàn quyền Đông Dương.\nĐề án được chính Toàn quyềnPaul Doumerphê chuẩn và chính ông cũng là người đặt tên cho dinh thự này là Villa Blanche, theo tên của con gái ông là bà Blanche Richel Doumer. Công trình được khởi công vào năm 1898, mãi đến năm 1902 mới hoàn thành. Do màu sơn bên ngoài cũng như tên gọi Villa Blanche nên người Việt quen gọi dinh thự này là Bạch Dinh. Paul Doumer chưa kịp sử dụng dinh thự này thì phải về nước. Người kế nhiệm làPaul Beaucó lẽ mới là người đầu tiên sử dụng nó. Tuy nhiên, đến tháng 9 năm 1907, nơi này được dùng làm nơi giam lỏng cựu hoàngThành Thái. Ông sống tại đây trong gần 10 năm. Dân địa phương kính trọng ông, nên còn gọi Bạch Dinh là Dinh ông Thượng.\nNăm 1916, cựu hoàng Thành Thái cùng con trai là cựu hoàngDuy Tânbị đưa đi đày rađảo Réunion. Bạch Dinh được sử dụng trở lại là nơi nghỉ mát của các Toàn quyền Đông Dương. Năm 1934, Bạch Dinh được nhượng lại để làm nơi nghỉ mát cho Hoàng đếBảo ĐạivàHoàng hậu Nam Phương.\nTrong những năm sau đó, dinh luôn được dùng làm nơi nghỉ mát của nguyên thủ hoặc các quan chức cao cấp của chính quyềnViệt Nam Cộng hòa. Sau năm 1975, có thời gian dinh không được sử dụng vào mục đích cụ thể nào trước khi chính thức được chuyển thành một địa điểm du lịch. Ngày[4](https://vi.wikipedia.org/wiki/4_th%C3%A1ng_8 \"4 tháng 8\")tháng 8năm 1992, Bạch Dinh đã được Bộ Văn hóa-Thông tin công nhận là _Di tích lịch sử văn hóa quốc gia_.\nBạch Dinh nằm ở phía nam núi Lớn, nằm ở vị trí cao 27m so vớimực nước biển. Bạch Dinh có kiến trúc châu Âu cuối thế kỷ 19, nhìn raBãi Trước, xung quanh là một khu rừng nhỏ với nhiều loại cây, đặc biệt làcây sứ.\n_Quang cảnh Bạch dinh_\nCó hai lối lên Bạch Dinh. Một đường uốn quanh chạy dưới rừng cây giá tỵ, dành cho[x](https://vi.wikipedia.org/wiki/%C3%94_t%C3%B4 \"Ô tô\")e hơilên tới tiền sảnh. Một đường đi bộ qua 146 bậc tam cấp cổ xưa, kín đáo nằm giữa hai hàng sứ cao niên. Bạch Dinh cao 19m, có ba tầng, mang đậm sắc thái kiến trúc của Pháp thời cuối thế kỷ 19. Tầng hầm dùng cho việc nấu nướng. Tầng trệt dùng làm khánh tiết. Tại đây còn bài trí những hiện vật cổ xưa dùng để trang trí nội thất như: Song bình Bách điểu chầu phụng, bộ tràng kỷ Hoàng Gia ghi niên đạiKhải Địnhnăm 1921, cặp ngà voi châu Phi dài 158 cm, bộ tam đa ngũ thái Phúc - Lộc - Thọ. Tầng lầu thoáng đạt dành cho việc nghỉ ngơi. Dạo quanh Bạch Dinh, du khách không khỏi ngạc nhiên về 8 bức tượng đá bán thân gắn trên một đường thẳng bao quanh ba mặt tường chính của tòa nhà. Hầu hết tượng đều mang phong cách của nghệ thuậtHy Lạp cổđại. Lúc bình minh hay khi chiều xế bóng, những bức tượng ký họa chân dung đối xứng trên nền chim công lấp lánh, trông thật tráng lệ.\nHiện nay, Bạch Dinh được dùng làm nhàbảo tàng, trưng bày các chuyên đề như:đồ gốmthờiKhang Hyvớt được từ xác tàu cổ đắm tại khu vực Hòn Cau -Côn Đảo, súng thần công cùng nhiều hiện vật có giá trị khác được tìm thấy qua các đợt khai quật khảo cổ ở Bà Rịa - Vũng Tàu… đến Bạch Dinh, du khách có thể tận hưởng không khí trong lành của biển, vẻ đẹp kiều diễm của Bạch Dinh hòa lẫn trong thiên nhiên cây cỏ, và được tận mắt thưởng ngoạn những cổ vật tiêu biểu, quý hiếm.\n_Nội thất sang trọng bên trong Bạch Dinh_\nTrải qua bao năm tháng cùng những biến động lịch sử, chứng kiến bao đời “chủ nhân” đến rồi lại đi, Bạch Dinh vẫn lặng yên bên sườn núi vững chãi, quay mặt hướng ra biển như chờ đợi du khách ghé thăm. Những lối đi xanh mát bóng cây, những bậc thang in dấu chân lịch sử, tất cả vẫn vẹn nguyên đưa du khách vào khu vườn cổ tích với những câu chuyện về ông hoàng năm xưa./.\nTrải qua bao năm tháng cùng những biến động lịch sử, chứng kiến bao đời “chủ nhân” đến rồi lại đi, Bạch Dinh vẫn lặng yên bên sườn núi vững chãi, quay mặt hướng ra biển như chờ đợi du khách ghé thăm. Những lối đi xanh mát bóng cây, những bậc thang in dấu chân lịch sử, tất cả vẫn vẹn nguyên đưa du khách vào khu vườn cổ tích với những câu chuyện về ông hoàng năm xưa./.\n[Bạch Dinh – Tòa biệt thự Pháp giữa lòng thành phố biển Vũng Tàu](https://phuong1.vungtau.baria-vungtau.gov.vn/di-tich-danh-thang/-/view-content/765862/bach-dinh-toa-biet-thu-phap-giua-long-thanh-pho-bien-vung-tau)\n\n\n\n\nhttps://vietnam.vnanet.vn/vietnamese/long-form/bach-dinh-%E2%80%93-toa-biet-thu-trang-voi-nhung-cau-chuyen-lich-su-329076.html\n# Bạch Dinh – Tòa biệt thự trắng với những câu chuyện lịch sử\n# Bạch Dinh – Tòa biệt thự trắng với những câu chuyện lịch sử\n**Đi trên đường Trần Phú, Phường 1, Thành phố Vũng Tàu ,********chúng ta luôn trông thấy hình ảnh một dinh thự màu trắng, mái ngói đỏ, n****ằm giữa Bãi Trước và Bãi Dâu, nằm bên sườn núi Lớn, với tầm nhìn hướng ra biển****. Đấy chính là****Villa Blanche hay còn gọi Bạch Dinh là điểm đến không thể bỏ qua khi đến thành phố Vũng Tàu**.\nBạch dinh nằm giữa Bãi Trước và Bãi Dâu, nằm bên sườn núi Lớn, với tầm nhìn hướng ra biển Vũng Tàu. Ảnh: Lê Minh\nBạch Dinh là tên gọi của tòa nhà Villa Blanche, nơi nghỉ mát cho toàn quyền Pháp tại Đông Dương, Paul Doumer, và các quan chức cấp cao thời Pháp - Mỹ.\nNội thất trong Bạch Dinh toát lên vẻ sang trọng và quý tộc.\nQuang cảnh Bạch Dinh\nBạch Dinh nằm bên sườn núi Lớn của thành phố Vũng Tàu tại địa chỉ số 4 đường Trần Phú, P.1, TP. Vũng Tàu. Ảnh: Lê Minh\n\n\n\n\nhttps://vi.wikipedia.org/wiki/B%E1%BA%A1ch_Dinh\n# Bạch Dinh\nBạch Dinh được chụp từ flycam trên cao để nhìn tổng thể. Bên cạnh là[Bảo tàng Thành phố Vũng Tàu](https://vi.wikipedia.org/w/index.php?title=B%E1%BA%A3o_t%C3%A0ng_Th%C3%A0nh_ph%E1%BB%91_V%C5%A9ng_T%C3%A0u&action=edit&redlink=1 \"Bảo tàng Thành phố Vũng Tàu \\(trang không tồn tại\\)\").\nMặt trước Bạch Dinh\n**Bạch Dinh**([tiếng Pháp](https://vi.wikipedia.org/wiki/Ti%E1%BA%BFng_Ph%C3%A1p \"Tiếng Pháp\"):_Villa Blanche_) là một dinh thự có kiến trúc châu Âu cuối thế kỷ 19, nằm bên sườn[núi Lớn](https://vi.wikipedia.org/wiki/N%C3%BAi_L%E1%BB%9Bn \"Núi Lớn\")của thành phố[Vũng Tàu](https://vi.wikipedia.org/wiki/V%C5%A9ng_T%C3%A0u \"Vũng Tàu\"). Nơi đây từng được dùng làm nơi nghỉ mát cho[Toàn quyền Đông Dương](https://vi.wikipedia.org/wiki/To%C3%A0n_quy%E1%BB%81n_%C4%90%C3%B4ng_D%C6%B0%C6%A1ng \"Toàn quyền Đông Dương\"), Hoàng đế[Bảo Đại](https://vi.wikipedia.org/wiki/B%E1%BA%A3o_%C4%90%E1%BA%A1i \"Bảo Đại\")và các đời[Tổng thống Việt Nam Cộng hòa](https://vi.wikipedia.org/wiki/T%E1%BB%95ng_th%E1%BB%91ng_Vi%E1%BB%87t_Nam_C%E1%BB%99ng_h%C3%B2a \"Tổng thống Việt Nam Cộng hòa\"). Nơi đây cũng là nơi chính quyền thuộc địa Pháp làm nơi giam lỏng vua[Thành Thái](https://vi.wikipedia.org/wiki/Th%C3%A0nh_Th%C3%A1i \"Thành Thái\")từ ngày 12 tháng 9 năm 1907 đến năm 1916. Ngày 4 tháng 8 năm 1992, Bạch Dinh đã được[Bộ Văn hóa-Thông tin](https://vi.wikipedia.org/wiki/B%E1%BB%99_V%C4%83n_h%C3%B3a_-_Th%C3%B4ng_tin \"Bộ Văn hóa - Thông tin\")công nhận là[Di tích lịch sử văn hóa quốc gia](https://vi.wikipedia.org/wiki/Di_t%C3%ADch_l%E1%BB%8Bch_s%E1%BB%AD_v%C4%83n_h%C3%B3a_qu%E1%BB%91c_gia \"Di tích lịch sử văn hóa quốc gia\").\nNgày nay, Bạch Dinh là một địa điểm tham quan của du khách khi đến Vũng Tàu.\nMột căn phòng có bàn trang điểm của hoàng hậu Nam Phương trong Bạch dinh\nĐề án được chính Toàn quyền[Paul Doumer](https://vi.wikipedia.org/wiki/Paul_Doumer \"Paul Doumer\")phê chuẩn và chính ông cũng là người đặt tên cho dinh thự này là**Villa Blanche** , theo tên của con gái ông là bà Blanche Richel Doumer.[[1]](https://vi.wikipedia.org/wiki/B%E1%BA%A1ch_Dinh#cite_note-1)Công trình được khởi công vào năm 1898, mãi đến năm 1902 mới hoàn thành. Do màu sơn bên ngoài cũng như tên gọi Villa Blanche nên người Việt quen gọi dinh thự này là Bạch Dinh.\nPaul Doumer chưa kịp sử dụng dinh thự này thì phải về nước. Người kế nhiệm là[Paul Beau](https://vi.wikipedia.org/wiki/Jean_Baptiste_Paul_Beau \"Jean Baptiste Paul Beau\")có lẽ mới là người đầu tiên sử dụng nó. Tuy nhiên, đến tháng 9 năm 1907, nơi này được dùng làm nơi giam lỏng cựu hoàng[Thành Thái](https://vi.wikipedia.org/wiki/Th%C3%A0nh_Th%C3%A1i \"Thành Thái\"). Ông sống tại đây trong gần 10 năm. Dân địa phương kính trọng ông, nên còn gọi Bạch Dinh là**Dinh ông Thượng**.\nNăm 1916, cựu hoàng Thành Thái cùng con trai là cựu hoàng[Duy Tân](https://vi.wikipedia.org/wiki/Duy_T%C3%A2n \"Duy Tân\")bị đưa đi đày ra[đảo Réunion](https://vi.wikipedia.org/wiki/R%C3%A9union \"Réunion\"). Bạch Dinh được sử dụng trở lại là nơi nghỉ mát của các Toàn quyền Đông Dương. Năm 1934, Bạch Dinh được nhượng lại để làm nơi nghỉ mát cho Hoàng đế[Bảo Đại](https://vi.wikipedia.org/wiki/B%E1%BA%A3o_%C4%90%E1%BA%A1i \"Bảo Đại\")và[Hoàng hậu Nam Phương](https://vi.wikipedia.org/wiki/Nam_Ph%C6%B0%C6%A1ng \"Nam Phương\").\nTrong những năm sau đó, dinh luôn được dùng làm nơi nghỉ mát của nguyên thủ hoặc các quan chức cao cấp của chính quyền[Việt Nam Cộng hòa](https://vi.wikipedia.org/wiki/Vi%E1%BB%87t_Nam_C%E1%BB%99ng_h%C3%B2a \"Việt Nam Cộng hòa\"). Sau năm 1975, có thời gian dinh không được sử dụng vào mục đích cụ thể nào trước khi chính thức được chuyển thành một địa điểm du lịch. Ngày[4 tháng 8](https://vi.wikipedia.org/wiki/4_th%C3%A1ng_8 \"4 tháng 8\")năm 1992, Bạch Dinh đã được Bộ Văn hóa-Thông tin công nhận là _**Di tích lịch sử văn hóa quốc gia**_.\nTượng theo phong cách Hy Lạp trên mặt tiền Bạch Dinh\nBạch Dinh nằm ở phía nam núi Lớn, nằm ở vị trí cao 27m so với[mực nước biển](https://vi.wikipedia.org/wiki/M%E1%BB%B1c_n%C6%B0%E1%BB%9Bc_bi%E1%BB%83n \"Mực nước biển\"). Bạch Dinh có kiến trúc châu Âu cuối thế kỷ 19, nhìn ra[Bãi Trước](https://vi.wikipedia.org/wiki/B%C3%A3i_Tr%C6%B0%E1%BB%9Bc_\\(V%C5%A9ng_T%C3%A0u\\) \"Bãi Trước \\(Vũng Tàu\\)\"), xung quanh là một khu rừng nhỏ với nhiều loại cây, đặc biệt là[cây sứ](https://vi.wikipedia.org/wiki/Chi_%C4%90%E1%BA%A1i \"Chi Đại\").\nHiện nay, Bạch Dinh được dùng làm nhà[bảo tàng](https://vi.wikipedia.org/wiki/Vi%E1%BB%87n_b%E1%BA%A3o_t%C3%A0ng \"Viện bảo tàng\"), trưng bày các chuyên đề như:[đồ gốm](https://vi.wikipedia.org/wiki/%C4%90%E1%BB%93_g%E1%BB%91m \"Đồ gốm\")thời[Khang Hy](https://vi.wikipedia.org/wiki/Khang_Hi \"Khang Hi\")vớt được từ xác tàu cổ đắm tại khu vực Hòn Cau -[Côn Đảo](https://vi.wikipedia.org/wiki/C%C3%B4n_%C4%90%E1%BA%A3o \"Côn Đảo\"), súng thần công cùng nhiều hiện vật có giá trị khác được tìm thấy qua các đợt khai quật khảo cổ ở Bà Rịa - Vũng Tàu… đến Bạch Dinh, du khách có thể tận hưởng không khí trong lành của biển, vẻ đẹp kiều diễm của Bạch Dinh hòa lẫn trong thiên nhiên cây cỏ, và được tận mắt thưởng ngoạn những cổ vật tiêu biểu, quý hiếm.\nNúi Lớn với Bạch Dinh nằm ở giữa bức ảnh.\nSúng thần công trưng bày trước Bạch Dinh.\nĐường hầm phía sau Bạch Dinh.\n* Bạch Dinh\n* [Dinh Cô](https://vi.wikipedia.org/wiki/Dinh_C%C3%B4 \"Dinh Cô\")\n* [Quần thể núi Chân Tiên - Dinh Cố](https://vi.wikipedia.org/w/index.php?title=Qu%E1%BA%A7n_th%E1%BB%83_n%C3%BAi_Ch%C3%A2n_Ti%C3%AAn_-_Dinh_C%E1%BB%91&action=edit&redlink=1 \"Quần thể núi Chân Tiên - Dinh Cố \\(trang không tồn tại\\)\")\n* [Bãi Dinh Cô](https://vi.wikipedia.org/w/index.php?title=B%C3%A3i_Dinh_C%C3%B4&action=edit&redlink=1 \"Bãi Dinh Cô \\(trang không tồn tại\\)\")\n* [Lễ hội Dinh Cô](https://vi.wikipedia.org/wiki/L%E1%BB%85_h%E1%BB%99i_Dinh_C%C3%B4 \"Lễ hội Dinh Cô\")\nBạch Dinh\n  *[x]: Xem bản mẫu này\n  *[t]: Thảo luận bản mẫu này\n  *[s]: Sửa bản mẫu này\n\n\n\n\n",
  "images": [
    "https://phuong1.vungtau.baria-vungtau.gov.vn/documents/378701/705292/1Bachdinh.png?t=1727249920171",
    "https://phuong1.vungtau.baria-vungtau.gov.vn/documents/378701/705292/2bachdinh.jpg?t=1727249920109",
    "https://phuong1.vungtau.baria-vungtau.gov.vn/documents/378701/705292/3bachdinh.png?t=1727249920062"
  ],
  "script": "# Phần 1: Giới thiệu tổng quan về Bạch Dinh\n\nĐứng trước cổng chính của Bạch Dinh, du khách sẽ không khỏi ngỡ ngàng trước vẻ đẹp lộng lẫy của tòa biệt thự mang tên Villa Blanche, hay còn gọi là Bạch Dinh. Nằm bên sườn núi Lớn, giữa Bãi Trước và Bãi Dâu, Bạch Dinh được xây dựng từ năm 1898 đến 1902, theo thiết kế của kiến trúc sư nổi tiếng người Pháp Gustave Eiffel. Tòa nhà mang đậm phong cách kiến trúc châu Âu cuối thế kỷ 19, với màu sơn trắng nổi bật và mái ngói đỏ, tạo nên một khung cảnh hài hòa giữa thiên nhiên và công trình kiến trúc.\n\nBạch Dinh không chỉ là một công trình kiến trúc độc đáo mà còn là một chứng nhân lịch sử, nơi đã từng là nơi nghỉ mát cho các Toàn quyền Đông Dương, Hoàng đế Bảo Đại và nhiều nhân vật quan trọng khác trong lịch sử Việt Nam. Với vị trí đắc địa, Bạch Dinh không chỉ mang lại không gian nghỉ ngơi lý tưởng mà còn là nơi ghi dấu những biến động lịch sử của đất nước.\n\n# Phần 2: Kiến trúc và bố cục của Bạch Dinh\n\nBước vào bên trong Bạch Dinh, du khách sẽ cảm nhận được sự sang trọng và quý phái của nội thất. Tòa nhà có ba tầng, với tầng hầm được sử dụng cho việc nấu nướng, tầng trệt dành cho khánh tiết và tầng lầu thoáng đãng dành cho việc nghỉ ngơi. Mỗi tầng đều được bài trí tinh tế, với những hiện vật cổ xưa như bộ tràng kỷ Hoàng Gia, cặp ngà voi châu Phi và nhiều đồ vật quý giá khác.\n\nĐặc biệt, du khách sẽ không thể bỏ qua 8 bức tượng đá bán thân được gắn trên ba mặt tường chính của tòa nhà. Những bức tượng này mang phong cách nghệ thuật Hy Lạp cổ đại, tạo nên một không gian trang nghiêm và lôi cuốn. Khi ánh sáng mặt trời chiếu rọi, những bức tượng như sống dậy, khiến cho Bạch Dinh trở nên huyền ảo hơn bao giờ hết.\n\n# Phần 3: Lịch sử xây dựng và những nhân vật liên quan\n\nBạch Dinh được khởi công xây dựng vào năm 1898, theo phê chuẩn của Toàn quyền Paul Doumer, người đã đặt tên cho dinh thự này theo tên con gái mình, bà Blanche Richel Doumer. Tuy nhiên, Paul Doumer chưa kịp sử dụng dinh thự này thì đã phải trở về Pháp. Người kế nhiệm, Paul Beau, là người đầu tiên sử dụng Bạch Dinh. Đặc biệt, vào tháng 9 năm 1907, Bạch Dinh trở thành nơi giam lỏng cựu hoàng Thành Thái, người đã sống tại đây gần 10 năm. Dân địa phương kính trọng ông và thường gọi Bạch Dinh là \"Dinh ông Thượng\".\n\nSau khi cựu hoàng Thành Thái bị đưa đi đày, Bạch Dinh lại được sử dụng làm nơi nghỉ mát cho các Toàn quyền Đông Dương. Đến năm 1934, dinh thự này được nhượng lại cho Hoàng đế Bảo Đại và Hoàng hậu Nam Phương. Qua nhiều thập kỷ, Bạch Dinh đã chứng kiến nhiều biến động lịch sử và trở thành một phần không thể thiếu trong ký ức của người dân Vũng Tàu.\n\n# Phần 4: Các hiện vật và chi tiết đáng chú ý\n\nBạch Dinh không chỉ nổi bật với kiến trúc mà còn là nơi lưu giữ nhiều hiện vật quý giá. Tại tầng trệt, du khách có thể chiêm ngưỡng bộ tràng kỷ Hoàng Gia ghi niên đại Khải Định năm 1921, cùng với những hiện vật khác như súng thần công và đồ gốm thời Khang Hy. Những hiện vật này không chỉ mang giá trị nghệ thuật mà còn chứa đựng nhiều câu chuyện lịch sử thú vị.\n\nNgoài ra, không gian xung quanh Bạch Dinh cũng rất đáng chú ý. Khu rừng nhỏ bao quanh tòa nhà với nhiều loại cây, đặc biệt là cây sứ, tạo nên một bức tranh thiên nhiên tuyệt đẹp. Đây là nơi lý tưởng để du khách thư giãn, tận hưởng không khí trong lành của biển và ngắm nhìn vẻ đẹp kiều diễm của Bạch Dinh hòa lẫn trong thiên nhiên.\n\n# Phần 5: Bạch Dinh trong lòng du khách\n\nTrải qua bao năm tháng, Bạch Dinh vẫn lặng yên bên sườn núi, quay mặt hướng ra biển, như chờ đợi du khách ghé thăm. Những lối đi xanh mát bóng cây, những bậc thang in dấu chân lịch sử vẫn vẹn nguyên, đưa du khách vào một khu vườn cổ tích với những câu chuyện về ông hoàng năm xưa. Ngày nay, Bạch Dinh đã trở thành một địa điểm du lịch hấp dẫn, thu hút nhiều du khách trong và ngoài nước đến tham quan, tìm hiểu về lịch sử và văn hóa của vùng đất Vũng Tàu. Hãy đến và khám phá Bạch Dinh, nơi lưu giữ những ký ức lịch sử và vẻ đẹp kiến trúc độc đáo của Việt Nam."
}